app/Controllers/Admin.php

    public function index()
    {
        $model = new CategoriaModel();
        $data['categorias'] = $model->findAll();
---
SELECT *
FROM `categorias`

    public function editar_productos($categoria_id)
{
    $catModel = new \App\Models\CategoriaModel();
    $prodModel = new \App\Models\ProductoModel();

    $data['categoria'] = $catModel->find($categoria_id);
    // Buscamos productos que pertenezcan a esta marca
    $data['productos'] = $prodModel->where('categoria_id', $categoria_id)->findAll();
---
SELECT *
FROM `categorias`
WHERE `categorias`.`id` = '4'
SELECT *
FROM `productos`
WHERE `categoria_id` = '4'

public function guardar_producto()
{
    $model = new \App\Models\ProductoModel();
    $data = [
        'categoria_id'    => $this->request->getPost('categoria_id'),
        'nombre'          => $this->request->getPost('nombre'),
        'unidad'          => $this->request->getPost('unidad'),
        'precio_compra'   => $this->request->getPost('precio_compra'),
        'margen_ganancia' => $this->request->getPost('margen_ganancia'),
    ];
    $model->insert($data);
---
INSERT INTO `productos` (`categoria_id`, `nombre`, `unidad`, `precio_compra`, `margen_ganancia`) VALUES ('4', 'helados', NULL, '2100', '40')