app/Controllers/Pedidos.php

SELECT *
FROM `categorias`
---
    public function nuevo($cliente_id)
    {
        $model = new CategoriaModel();

        $data['cliente_id'] = $cliente_id;
        $data['categorias'] = $model->findAll();